.config/emacs/config.org
** All The Icons
#+begin_src emacs-lisp
(use-package all-the-icons
  :ensure t
  :if (display-graphic-p))
(use-package all-the-icons-dired
  :hook (dired-mode . (lambda () (all-the-icons-dired-mode t))))
#+end_src

** Nerd Icons
#+begin_src emacs-lisp
(use-package nerd-icons)
#+end_src

** Rainbow Mode
#+begin_src emacs-lisp
(use-package rainbow-mode
  :hook
  ((org-mode prog-mode) . rainbow-mode))
#+end_src

** General (Keybinds) 
#+begin_src emacs-lisp
(use-package general
  :config
  (general-evil-setup t)
  (general-define-key
    "C-x C-r" 'reload-init-file :wk "Reload init file")

  (general-create-definer my-leader-def
    :prefix "C-c") 

  (my-leader-def
    "t" '(:ignore t :wk "Toggles")
    "t n" '(neotree-toggle :wk "Toggle neotree")
    "t v" '(vterm-toggle :wk "Toggle vterm"))
  (my-leader-def
    "o" '(:ignore o :wk "Open")
    "o r" '(recentf :wk "Open recent file"))
    "o b" '(ibuffer :wk "Open ibuffer"))
#+end_src

** Highlight TODO
#+begin_src emacs-lisp
(use-package hl-todo
  :hook ((org-mode . hl-todo-mode)
         (prog-mode . hl-todo-mode))
  :config
  (setq hl-todo-highlight-punctuation ":"
        hl-todo-keyword-faces
        `(("TODO"       warning bold)
          ("FIXME"      error bold)
          ("HACK"       font-lock-constant-face bold)
          ("REVIEW"     font-lock-keyword-face bold)
          ("NOTE"       success bold)
          ("DEPRECATED" font-lock-doc-face bold))))
#+end_src

** CompAny
#+begin_src emacs-lisp
(use-package company
  :after lsp-mode
  :diminish
  :hook (prog-mode . company-mode)
  :bind (:map company-active-map
         ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
         ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-begin-commands '(self-insert-command))
  (company-idle-delay .1)
  (company-minimum-prefix-length 2)
  (company-show-numbers t)
  (company-tooltip-align-annotations 't)
  (global-company-mode t)
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(use-package company-box
  :after company
  :diminish
  :hook (company-mode . company-box-mode))
#+end_src

** Diminish
#+begin_src emacs-lisp
(use-package diminish)
#+end_src

** Hydra
#+begin_src emacs-lisp
(use-package hydra)
#+end_src

** Ligatures
#+begin_src emacs-lisp
(use-package ligature
  :config
  (ligature-set-ligatures 'prog-mode '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
                                       ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                                       "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                                       "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                                       "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
                                       "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
                                       "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
                                       "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
                                       ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                                       "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                                       "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
                                       "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
                                       "\\\\" "://"))
  (global-ligature-mode t))
#+end_src


* FONTS
** Setting Font Face
#+begin_src emacs-lisp
  (set-face-attribute 'default nil
    :font "FantasqueSansM Nerd Font Mono"
    :height 110
    :weight 'medium)
  (set-face-attribute 'variable-pitch nil
    :font "SF Pro Display"
    :height 120
    :weight 'medium)
  (set-face-attribute 'fixed-pitch nil
    :font "FantasqueSansM Nerd Font Mono"
    :height 110
    :weight 'medium)
  (set-face-attribute 'font-lock-comment-face nil
    :slant 'italic)
  (set-face-attribute 'font-lock-keyword-face nil
    :slant 'italic)
#+end_src

** Fix Font Loading in Emacsclient Mode
#+begin_src emacs-lisp
  (add-to-list 'default-frame-alist '(font . "FantasqueSansM Nerd Font Mono-12"))
#+end_src


* TWEAKS
** UI
#+begin_src emacs-lisp
(delete-selection-mode 1)    ;; You can select text and delete it by typing.
(electric-pair-mode 1)       ;; Turns on automatic parens pairing
;; The following prevents <> from auto-pairing when electric-pair-mode is on.
;; Otherwise, org-tempo is broken when you try to <s TAB...
(add-hook 'org-mode-hook (lambda ()
           (setq-local electric-pair-inhibit-predicate
                  `(lambda (c)
                  (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))
(column-number-mode)
(global-auto-revert-mode t)  ;; Automatically show changes if the file has changed.
(setq display-line-numbers-type 'relative) 
(global-display-line-numbers-mode t) ;; Display line numbers.
(global-visual-line-mode t)  ;; Enable truncated lines.
(menu-bar-mode -1)           ;; Disable the menu bar.
(scroll-bar-mode -1)         ;; Disable the scroll bar.
(tool-bar-mode -1)           ;; Disable the tool bar.
(setq org-edit-src-content-indentation 0) ;; Set src block automatic indent to 0 instead of 2.
(global-set-key [escape] 'keyboard-escape-quit) ;; You only need to hit ESC once!
(global-set-key (kbd "C-=") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
(global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
(global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)
#+end_src

** Backup
#+begin_src emacs-lisp
(setq backup-directory-alist '((".*" . "~/.local/share/Trash/files"))) ;; Sends all backup files to trash.
#+end_src


* ORG MODE
** Table of Contents
#+begin_src emacs-lisp
(use-package toc-org
    :commands toc-org-enable
    :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

** Org Bullets
#+begin_src emacs-lisp
(add-hook 'org-mode-hook 'org-indent-mode)
(use-package org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src

** Diminish Org Indent Mode
#+begin_src emacs-lisp
(eval-after-load 'org-indent '(diminish 'org-indent-mode))
#+end_src

** Org Level Headers
#+begin_src emacs-lisp
(custom-set-faces
 '(org-level-1 ((t (:inherit outline-1 :height 1.7))))
 '(org-level-2 ((t (:inherit outline-2 :height 1.6))))
 '(org-level-3 ((t (:inherit outline-3 :height 1.5))))
 '(org-level-4 ((t (:inherit outline-4 :height 1.4))))
 '(org-level-5 ((t (:inherit outline-5 :height 1.3))))
 '(org-level-6 ((t (:inherit outline-5 :height 1.2))))
 '(org-level-7 ((t (:inherit outline-5 :height 1.1)))))
#+end_src

** Org-Tempo
Usage: 
|------------------------------------------------------------------|
| Typing the below + TAB | Expands to ...                          |
|------------------------|-----------------------------------------|
| <a                     | '#+BEGIN_EXPORT ascii' … '#+END_EXPORT  | 
| <c                     | '#+BEGIN_CENTER' … '#+END_CENTER'       | 
| <C                     | '#+BEGIN_COMMENT' … '#+END_COMMENT'     | 
| <e                     | '#+BEGIN_EXAMPLE' … '#+END_EXAMPLE'     | 
| <E                     | '#+BEGIN_EXPORT' … '#+END_EXPORT'       | 
| <h                     | '#+BEGIN_EXPORT html' … '#+END_EXPORT'  | 
| <l                     | '#+BEGIN_EXPORT latex' … '#+END_EXPORT' | 
| <q                     | '#+BEGIN_QUOTE' … '#+END_QUOTE'         | 
| <s                     | '#+BEGIN_SRC' … '#+END_SRC'             | 
| <v                     | '#+BEGIN_VERSE' … '#+END_VERSE'         | 
|------------------------------------------------------------------| 

#+begin_src emacs-lisp 
(require 'org-tempo) 
#+end_src 


* RELOAD EMACS 
#+begin_src emacs-lisp 
(defun reload-init-file () 
  (interactive)
  (server-start))
#+end_src


* SHELLS & TERMINALS
** Vterm
#+begin_src emacs-lisp
(use-package vterm
:config
(setq shell-file-name "/usr/bin/zsh"
      vterm-max-scrollback 5000))
#+end_src

** Vterm Toggle
#+begin_src emacs-lisp
(use-package vterm-toggle
  :after vterm
  :config
  (setq vterm-toggle-fullscreen-p nil)
  (setq vterm-toggle-scope 'project)
  (add-to-list 'display-buffer-alist
               '((lambda (buffer-or-name _)
                     (let ((buffer (get-buffer buffer-or-name)))
                       (with-current-buffer buffer
                         (or (equal major-mode 'vterm-mode)
                             (string-prefix-p vterm-buffer-name (buffer-name buffer))))))
                  (display-buffer-reuse-window display-buffer-at-bottom)
                  (reusable-frames . visible)
                  (window-height . 0.3))))
#+end_src


* DEVELOPMENT TOOLS
